content-org/all-posts.org
#+hugo_base_dir: ../
* DONE Link Roundup: August 12, 2024
CLOSED: [2024-08-12 Fri 19:15]
:PROPERTIES:
:EXPORT_FILE_NAME: link-roundup-08-12-2024
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :summary "This week's link roundup includes the unique combination of an article on the most-cited authors in the Stanford Encyclopedia of Philosophy and advice on non-scalable activities for startups."
:ID:       A65B631D-688D-4728-BCC5-68D608A77EE8
:END:

This week's link roundup includes the unique combination of an article
on the most-cited authors in the Stanford Encyclopedia of Philosophy and
advice on non-scalable activities for startups.

As always, I generate summaries using AI and edit those summaries for
accuracy and usefulness. Then, I offer some thoughts of my own.

** Eric Schwitzgebel, "The 376 Most-Cited Contemporary Authors in the
:PROPERTIES:
:ID:       CDA8C17B-3548-41F5-8474-93A6EC3B69F0
:END:
Stanford Encyclopedia of Philosophy"
   :PROPERTIES:
   :CUSTOM_ID: eric-schwitzgebel-the-376-most-cited-contemporary-authors-in-the-stanford-encyclopedia-of-philosophy
   :END:
[[https://schwitzsplinters.blogspot.com/2024/08/the-378-most-cited-contemporary-authors.html][Link
to Article]]

*** Generated Summary (ChatGPT)
    :PROPERTIES:
    :CUSTOM_ID: generated-summary-chatgpt
    :ID:       884377E8-1A7E-4208-A5B2-3DF4B9186038
    :END:
The blog post updates the list of the most-cited contemporary authors in
the Stanford Encyclopedia of Philosophy, focusing on those born
after 1900. The methodology accounts for co-authors and editors, though
it has some limitations, such as biases in citation practices and errors
in data coding. The list reflects influence within mainstream Anglophone
philosophy, but certain philosophers, like Michel Foucault, are
underrepresented due to differing citation practices.

*** My Thoughts
    :PROPERTIES:
    :CUSTOM_ID: my-thoughts
    :ID:       03A90B47-8978-4FD9-9498-8F17C9983F5F
    :END:
This is a fascinating project. The insights that a data-driven approach
to citation mapping offers are not complete or representative, but they
do suggest interesting things about a field. There has been similar work
in other fields (see
[[https://derekmueller.net/rc/cv/ms/mueller-longtail-ccc.pdf][Derek
Mueller's analysis]] of citation in rhetoric and writing studies) but,
as a reader of philosophy, I found this one particularly compelling both
for its data and for the methodological considerations from
Schwitzgebel. I highly recommend the comments section, too, for
necessary questions about who is included in "top lists" of academic
fields.

** Graham, "Do Things that Don't Scale"
   :PROPERTIES:
   :CUSTOM_ID: graham-do-things-that-dont-scale
   :ID:       A34C0A4D-CB2D-4AE7-8663-ECD8175E39E6
   :END:
[[https://paulgraham.com/ds.html][Link to Article]]

*** Generated Summary (ChatGPT)
    :PROPERTIES:
    :CUSTOM_ID: generated-summary-chatgpt-1
    :ID:       1664F7BB-98FD-443B-B49D-CABD5BD1CF45
    :END:
Graham advises startups to engage in non-scalable tasks, especially in
their early stages, to build a strong foundation. He emphasizes the
importance of hands-on approaches like personal customer interactions,
manual user acquisition, and crafting tailored solutions. These efforts,
though not scalable, are crucial for understanding customer needs,
building a loyal user base, and gaining valuable insights that can guide
scalable growth later on. The key message is that scaling prematurely
can be detrimental to long-term success.

*** My Thoughts
    :PROPERTIES:
    :CUSTOM_ID: my-thoughts-1
    :ID:       B9A33BA0-5D3B-4DCD-9FAB-6F722E5C5E58
    :END:
I hadn't read this article before, but I saw it cited elsewhere as a
foundational piece of advice for startups and decided to check it out.
As with several things lately, it fits right in with my developing
critique of the optimization mindset. At a certain point, ideas about
optimizing can overtake that actual work of /effort./ Graham makes that
point in a number of ways related to startups, but the broad takeaway is
that it's often the things that /don't/ immediately yield or even center
"results" that lay the foundation for growth, which is something that
goes far beyond startups.

