content/posts/link-roundup-08-12-2024.md
+++
title = "Link Roundup: August 12, 2024"
author = ["Rick Wysocki"]
date = 2024-08-12T19:15:00-04:00
draft = false
summary = "Here is my post summary."
+++

This week's link roundup includes the unique combination of an article
on the most-cited authors in the Stanford Encyclopedia of Philosophy and
advice on non-scalable activities for startups.

As always, I generate summaries using AI and edit those summaries for
accuracy and usefulness. Then, I offer some thoughts of my own.


## Eric Schwitzgebel, "The 376 Most-Cited Contemporary Authors in the {#eric-schwitzgebel-the-376-most-cited-contemporary-authors-in-the}

Stanford Encyclopedia of Philosophy"

:CUSTOM_ID: eric-schwitzgebel-the-376-most-cited-contemporary-authors-in-the-stanford-encyclopedia-of-philosophy

[Link
to Article](https://schwitzsplinters.blogspot.com/2024/08/the-378-most-cited-contemporary-authors.html)


### Generated Summary (ChatGPT) {#generated-summary-chatgpt}

The blog post updates the list of the most-cited contemporary authors in
the Stanford Encyclopedia of Philosophy, focusing on those born
after 1900. The methodology accounts for co-authors and editors, though
it has some limitations, such as biases in citation practices and errors
in data coding. The list reflects influence within mainstream Anglophone
philosophy, but certain philosophers, like Michel Foucault, are
underrepresented due to differing citation practices.


### My Thoughts {#my-thoughts}

This is a fascinating project. The insights that a data-driven approach
to citation mapping offers are not complete or representative, but they
do suggest interesting things about a field. There has been similar work
in other fields (see
[Derek
Mueller's analysis](https://derekmueller.net/rc/cv/ms/mueller-longtail-ccc.pdf) of citation in rhetoric and writing studies) but,
as a reader of philosophy, I found this one particularly compelling both
for its data and for the methodological considerations from
Schwitzgebel. I highly recommend the comments section, too, for
necessary questions about who is included in "top lists" of academic
fields.


## Graham, "Do Things that Don't Scale" {#graham-do-things-that-dont-scale}

[Link to Article](https://paulgraham.com/ds.html)


### Generated Summary (ChatGPT) {#generated-summary-chatgpt-1}

Graham advises startups to engage in non-scalable tasks, especially in
their early stages, to build a strong foundation. He emphasizes the
importance of hands-on approaches like personal customer interactions,
manual user acquisition, and crafting tailored solutions. These efforts,
though not scalable, are crucial for understanding customer needs,
building a loyal user base, and gaining valuable insights that can guide
scalable growth later on. The key message is that scaling prematurely
can be detrimental to long-term success.


### My Thoughts {#my-thoughts-1}

I hadn't read this article before, but I saw it cited elsewhere as a
foundational piece of advice for startups and decided to check it out.
As with several things lately, it fits right in with my developing
critique of the optimization mindset. At a certain point, ideas about
optimizing can overtake that actual work of _effort._ Graham makes that
point in a number of ways related to startups, but the broad takeaway is
that it's often the things that _don't_ immediately yield or even center
"results" that lay the foundation for growth, which is something that
goes far beyond startups.
